drop table goodsmessage;

create table goodsmessage
(
goodsid int auto_increment,
goodsname varchar(50) not null,
gtype varchar(50) not null,
gprice double not null, 
gdate date not null,
gamount int not null,
gimgurl varchar(100) default 'img/wel.gif',
gintroduction text not null,
constraint pk primary key(goodsid) 
);


insert into goodsmessage values(1,'奥运福娃漫游记','图书',52.55,
'2001-10-2',55,'img/book/807200001.jpg','这是一本极其有趣的童话故事书！！');

insert into goodsmessage values(2,'笑死我的英文书','图书',12,
'2001-10-1',55,'img/book/807200007.jpg','这是一本极其有趣的英文书！！');

insert into goodsmessage values(3,'新概念英语1','图书',22,'2007-10-1',55,'img/book/807200006.jpg','这是一本对大中学生很有帮助的英文书！！');

insert into goodsmessage values(4,'新托福考试','图书',11,'2008-11-1',55,'img/book/807200009.jpg','这是一本极其有用的托福考试书！！');

insert into goodsmessage values(5,'生活英语100','图书',44,'2008-10-1',55,'img/book/807200008.jpg','这是一本极其有趣的英文书！！');

insert into goodsmessage values(6,'那山那人那水','DVD',52,'2008-10-3',55,'img/DVD/807200002.jpg','这是一本很有韵味的农村生活场景片！！');

insert into goodsmessage values(7,'功夫之王','DVD',34.55,'2001-10-3',55,'img/DVD/807200003.jpg','一个夏日，这个十七岁的男孩骑着脚踏车，到波士顿唐人街的一家当铺寻找具有收藏价值的中国功夫片，但他总是在穿过自己家附近的巷子时遇到麻烦，因为杰森经常被一群混混盯上，并且常受到他们的欺负。杰森精通电子游戏，对于功夫片也是如数家珍，他总是希望自己也能成为一名功夫高手，然而当铺的老板老霍却认为，杰森根本不是这块料，他根本不知道什么是功夫。');

insert into goodsmessage values(8,'功夫','DVD',52.55,'2001-4-1',55,'img/DVD/807200004.jpg','故事发生在20世纪40年代的中国，周星驰饰演一个一事无成、小偷小摸的古惑仔，立志加入当时势力最大、手段残忍的黑帮“斧头帮”。星仔试图在一个叫“猪笼城寨”的地方对居民敲诈，却不知道他们个个身怀绝技，结果在这里栽了跟头。星仔与居民的冲突不经意地将“斧头帮”戏剧性地卷入其中，正反两派之间的斗争正式展开。从“猪笼城寨”居民为生存而战发展到两派武术高手间的交锋，星仔渐渐地放弃了从前的思想和志向，开始领悟功夫的真谛');

insert into goodsmessage values(9,'武状元苏乞儿','DVD',16.55,
'2001-1-1',55,'img/DVD/807200005.jpg','苏查哈尔灿生活在大将军府邸，武功高强，但性格狂放。因爱如霜姑娘而竞考武状元。但因考官舞弊，被皇上御贬终身乞讨。与曾经奢靡生活简直天壤之别，一时不振，只是睡觉。忽然一天，被丐帮创始人洪七公传入梦中点醒。学会了睡觉罗汉拳，并做了帮主之位。领导丐帮灭反贼，救皇上，永垂青史。');

insert into goodsmessage values(10,'李宁女子风衣','服装',456,'2001-10-1',5,'img/huowu/clothes.jpg','李宁牌创建于1990年，十余年来，李宁公司由最初单一的运动服装发展到拥有运动服装、运动鞋、运动器材等多个产品系列的专业化体育用品公司。目前，""李宁""产品结构日趋完善，现在，""李宁""在中国体育用品行业中已位居举足轻重的领先地位。Z-DO是李宁旗下的一个子品牌，产品线和李宁的系列产品完全一样，这个品牌是李宁在07年4月份新推出的，性价比比较高。');

insert into goodsmessage values(11,'天然翡翠手链★福运来','饰品',456,
'2001-10-1',5,'img/huowu/hand.jpg','翡翠是玉石之王，自古以来翡翠都有治疗皮肤病和关节病的传说，中国古时候以翡翠作为腰佩的最佳选料。翡翠一其柔润而妖艳的绿色，摘取了“玉石之王”的桂冠，象征着幸运和幸福， 并誉为“幸福之石”。清明的时候，翡翠空前的盛行，慈禧太后对翡翠情有独钟，并把人性五义赋予翡翠，是翡翠拥有人性。以至后来用玉形容君子，既“君子如玉”来形容一个人的人品。《诗》曰：言念君子，温其如玉，此之谓也。 随着人类文明的进步和人们对翡翠的了解、热爱，翡翠在人们的心目里不仅仅是玉石，而是逐渐形成了一种文化。翡翠雕件不同形象蕴涵了不同的寓意，“吉祥如意，富寿平安，玉地高贵，以得比玉”都成为现在的流行。');

insert into goodsmessage values(12,'lux-womenS925银镶嵌吊坠-灵动','饰品',456,
'2001-10-1',5,'img/huowu/necklace.jpg','lux-womenS925银镶嵌吊坠-蓝色精灵。S925银的线条内是自由转动蓝色精灵！那一份灵动给我们飘扬的心情！');

insert into goodsmessage values(13,'梦特娇高级礼品和谐系列铱金笔M31106金桔黄','文具',456,
'2001-10-1',52,'img/huowu/goldpen.jpg','梦特娇书写工具有世界资深专家领衔设计,选用上等优质树脂材料和钻石.白金.黄金及纯银等珍贵金属,结合国际最精湛的制笔工艺,有专业工艺师精心打造而成.在设计元素中,时尚与经典和谐搭配,细节与精致品位完美勾勒,将世界文化元素融贯其中,豪华的包装,确保书写效能完美顺畅.是您馈赠亲朋好友的理想选择。');

insert into goodsmessage values(14,'派克丰采系列纯黑钢笔','文具',356,
'2001-10-1',25,'img/huowu/pen.jpg','传统而极具品味的工艺配饰成就了讽刺啊流线型的外表传统而极具品味的工艺配饰成就了丰采流线型的外表。这是一款富有个性，优雅迷人的笔，展现的是一个行家的内在。配以坚硬的23K镀金不锈钢笔尖。采用双管式供汲墨系统。适用抽取式吸墨器汲取墨水。可适用派克墨水芯。');

insert into goodsmessage values(15,'榨汁机','电器',15,'2001-10-1',25,'img/huowu/1.png','居家路性必备之良品！！');

insert into goodsmessage values(16,'周杰伦最新唱片','VCD',56,'2001-10-1',52,'img/huowu/2.png','周董今年的最富收藏价值的唱片！');

insert into goodsmessage values(17,'NOKIA手机','手机',5336,'2001-10-1',52,'img/huowu/3.png','功能强大！');













